<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Juergen Hummel">
   <title>WebMail</title>
</head>

<body>
<table width="100%"><tr><td><h1>Dokumentation zum WebMail-Interface</h1></td><td align="right">( Version 2.1 )</td></tr></table>
<h4><IMG SRC="letter.gif" ALIGN="right" ALT="letter" BORDER="0">Inhalt</h4>

<ol>
<li><a href="#M1">Leistungsmerkmale und Systemvoraussetzungen</a></li>
<li><a href="#M2">Installation</a></li>
<li><a href="#M3">Starten des Webmail-Interface</a></li>
<li><a href="#M4">Demonstrationsm&ouml;glichkeit</a></li>
<li><a href="#M5">Anpassung des Layouts</a></li>
<ol>
<li><a href="#M51">zentrales Masterlayout</a></li>
<li><a href="#M52">Detailschablonen</a></li>
</ol>
<li><a href="#M6">Benutzereinrichtung und -verwaltung</a></li>
<ol>
<li><a href="#M61">&ouml;ffentliche Benutzerdatenverwaltung durch die Benutzer</a></li>
<li><a href="#M62">gesch&uuml;tzte Benutzerverwaltung durch den Administrator</a></li>
</ol>
<li><a href="#M7">Sicherheitshinweise</a></li>
<li><a href="#M8">bekannte Probleme</a></li>
<li><a href="#M9">Vollversion und rechtliche Hinweise</a></li>
</ol>

<h2><hr WIDTH="100%"><a NAME="M1"></a>1. Leistungsmerkmale und Systemvoraussetzungen</h2>
<b><font color="#006600">WebMail</font></b> ist ein komfortabel zu bedienendes
Webmail-Interface, das in Versionen f&uuml;r Microsoft-IIS-Webserver und andere unter Microsoft-Windows laufende Webserver
sowie in einer Version f&uuml;r Linux-Webserver vorliegt.
<b><font color="#006600">WebMail</font></b> arbeitet unter diesen beiden Plattformen auf allen Webservern,
die &uuml;ber ein CGI-Interface verf&uuml;gen oder ISAPI-Webservererweiterungen unterst&uuml;tzen.
<p><b><font color="#006600">WebMail</font></b> erlaubt den uneingeschr&auml;nkten
Zugriff auf lokale oder ferne POP3- und SMTP-Server. Unterschiedliche Benutzer
k&ouml;nnen per Browser auf beliebige Mailserver zugreifen und ihre Postf&auml;cher
einsehen, Nachrichten lesen, Mailanh&auml;nge herunterladen und speichern,
einzelne e-Mails auf dem Server l&ouml;schen sowie eigene Nachrichten mit und ohne Anhang versenden und weiterleiten.
(Im Detail ist ein e-Mail-Kern gem&auml;&szlig; RFC 821, RFC 1939 und RFC 2554 implementiert, der die
POP3-Kommandos <i>USER</i>, <i>PASS</i>, <i>STAT</i>, <i>UIDL</i>, <i>LIST</i>, <i>TOP</i>, <i>RETR</i>, <i>DELE</i>, <i>QUIT</i> und die
SMTP-Kommandos: <i>HELO</i>, <i>EHLO</i>, <i>AUTH</i>, <i>MAIL</i>, <i>RCPT</i>, <i>DATA</i> und <i>QUIT</i> beherrscht.)</p>
<p>Einer der entscheidenden Vorz&uuml;ge von <b><font color="#006600">WebMail</font></b>
ist es, dass der Webmaster das Layout der erzeugten Mailbox-Seiten auf einfache Art und Weise durch eine individuelle
Anpassung von Schablonenseiten (HTML-Templates) schnell, bequem und in sehr weiten Grenzen an den
Stil des sonstigen Webs angleichen kann.</p>
<p>Der Zugang zu <b><font color="#006600">WebMail</font></b> erfolgt gesch&uuml;tzt &uuml;ber einen Benutzernamen und ein Passwort.
Die Zugangsdaten f&uuml;r die Postf&auml;cher werden in einer Benutzerdatenbank bereitgehalten.
Der Administrator des Webservers entscheidet, ob jeder Benutzer von <b><font color="#006600">WebMail</font></b> seine
Daten in der Benutzerdatenbank teilweise oder vollst&auml;ndig selbst bearbeiten kann oder dieses nur dem Webmaster erlaubt ist.
Alle schutzw&uuml;rdigen Benutzerangaben werden verschl&uuml;sselt gespeichert (ohne Sicherheits-Zertifikat).</p>

<h2><a NAME="M2"></a>2. Installation</h2>
Das Webmail-Interface verf&uuml;gt <i>nicht</i> &uuml;ber eine automatische Installationsroutine.
Die wenigen notwendigen Schritte zur Einrichtung von <b><font color="#006600">WebMail</font></b>
bestehen im Anlegen von drei Verzeichnissen und dem Kopieren der Dateien und sind die Folgenden:
<ol>
<li><p>Legen Sie in Ihrem Web ein neues virtuelles Serververzeichnis (vorzugsweise &quot;/wmprog&quot;) als Programmverzeichnis an.
Dieses kann (mu&szlig; aber nicht) ein Unterverzeichnis zum meist vorhandenen &quot;/cgi-bin&quot; oder &quot;/scripts&quot; sein.
Auch &quot;/cgi-bin&quot; oder &quot;/scripts&quot; selbst k&ouml;nnen Sie unter Umst&auml;nden als Programmverzeichnis
f&uuml;r <b><font color="#006600">WebMail</font></b> verwenden.
Diese Verzeichnis wird im folgenden als <i>Programm</i>verzeichnis bezeichnet.</p>
<p>Versehen Sie das Programmverzeichnis unter Windows &uuml;ber die Verwaltungskonsole Ihres Webservers mit den
Server-Rechten: <i>Ausf&uuml;hren</i>, <i> kein Lesen</i> und <i>keine Scripte</i>.</p>
<p>Unter Linux empfehle ich, das vorhandene &quot;/cgi-bin&quot; zu nutzen bzw. dort ein Unterverzeichnis zu erstellen.
Anderenfalls ist &uuml;ber die Serverkonfiguration des Apache-Webservers zu gew&auml;hrleisten, dass das Programmverzeichnis
ein <i>ScriptAlias</i> ist und/oder &uuml;ber die Option <i>+ExecCGI</i> verf&uuml;gt, sodass CGI-Programme hier ausgef&uuml;hrt werden k&ouml;nnen.</p><br></li>
<li>Kopieren Sie alle Dateien der <b><font color="#006600">WebMail</font></b>-Applikation
in dieses Programmverzeichnis. Das sind im Einzelnen:
<table CELLSPACING=3 CELLPADDING=2 WIDTH="90%">
<tr BGCOLOR="#FFFF99"><td>Datei</td><td>Bedeutung</td></tr>
<tr BGCOLOR="#FFFFCC"><td>webmail.dll &nbsp; oder<br>webmail.exe &nbsp; bzw.<br>webmail.cgi</td><td>Servererweiterung f&uuml;r Windows-Webserver als ISAPI-Extension oder<br>als CGI-Anwendung f&uuml;r Windows oder<br>als CGI-Anwendung f&uuml;r Linux</td></tr>
<tr BGCOLOR="#FFFFCC"><td>webmail.ini &nbsp; <sup>**</sup></td><td>Variablendatei des Webmail-Interfaces <sup>**</sup></td></tr>
<tr BGCOLOR="#FFFFCC"><td>webmail.htm</td><td>Masterschablone f&uuml;r das Layout <i>aller</i> Ausgabeseiten des Webmail-Interfaces - Mastervorlage</td></tr>
<tr BGCOLOR="#FFFFCC"><td>login.htm</td><td>Detailschablone f&uuml;r das Login-Formular</td></tr>
<tr BGCOLOR="#FFFFCC"><td>folders.htm</td><td>Schablone f&uuml;r die pers&ouml;nliche Ordner&uuml;bersicht</td></tr>
<tr BGCOLOR="#FFFFCC"><td>mailbox.htm</td><td>Detailschablone f&uuml;r die Mailboxseite mit dem Posteingang</td></tr>
<tr BGCOLOR="#FFFFCC"><td>privbox.htm</td><td>Detailschablone f&uuml;r die pers&ouml;nlichen Nachrichtenarchive</td></tr>
<tr BGCOLOR="#FFFFCC"><td>showmail.htm</td><td>Detailschablone f&uuml;r angezeigte e-Mail-Inhalte</td></tr>
<tr BGCOLOR="#FFFFCC"><td>writemail.htm</td><td>Formularschablone zum Verfassen einer neuen Nachricht</td></tr>
<tr BGCOLOR="#FFFFCC"><td>sendok.htm</td><td>Detailschablone f&uuml;r eine Sendebest&auml;tigung</td></tr>
<tr BGCOLOR="#FFFFCC"><td>textpieces.htm</td><td>Formularmaske f&uuml;r die Signatur und eventuelle Textbausteine</td></tr>
<tr BGCOLOR="#FFFFCC"><td>adrlist.htm, adrshow.htm</td><td>Schablonen f&uuml;r ein pers&ouml;nliches Adressbuch</td></tr>
<tr BGCOLOR="#FFFFCC"><td>adrcent.htm</td><td>Schablonen f&uuml;r das zentrale Adressbuch</td></tr>
<tr BGCOLOR="#FFFFCC"><td>abook.htm</td><td>Schablone f&uuml;r die Kurzform des pers&ouml;nlichen Adressbuches</td></tr>
<tr BGCOLOR="#FFFFCC"><td>admin.htm</td><td>Detailschablone f&uuml;r das Benutzer-Administrationsformular zur Benutzerdateneingabe</td></tr>
<tr BGCOLOR="#FFFFCC"><td>adminok.htm</td><td>Detailschablone f&uuml;r die Best&auml;tigung der Datenspeicherung in der Benutzerdatenbank</td></tr>
<tr BGCOLOR="#FFFFCC"><td>users1.htm, users2.htm</td><td>Schablonen f&uuml;r die Benutzerverwaltung durch den Webmaster</td></tr>
</table>
<sup>**</sup> <u>Achtung</u>: Diese eine Datei <i>webmail.ini</i> ben&ouml;tigt Schreibrechte!
Bei einigen Windows-Systemen reicht die Schreibfreigabe &uuml;ber den Internet-Dienste-Manager nicht aus.
Setzen Sie dann f&uuml;r diese eine Datei &quot;webmail.ini&quot; auf Betriebssystemebene das Recht &quot;Schreiben&quot; f&uuml;r &quot;Jeden&quot; Benutzer.
Unter Linux ist <nobr>&quot;rw-rw-rw-&quot;</nobr> (chmod 666) meist die passende Einstellung.
Wenn <b><font color="#006600">WebMail</font></b> endg&uuml;ltig eingerichtet und zur Vollversion freigeschaltet ist,
sind f&uuml;r den sp&auml;teren Betrieb die Schreibrechte bei dieser Datei <i>webmail.ini</i> nicht mehr notwendig.<br>
<p>Die Programmdatei <i>webmail.cgi</i> (Linux) bzw. <i>webmail.exe</i> (Windows-CGI) oder <i>webmail.dll</i> (ISAPI) muss unbedingt <i>bin&auml;r</i> auf den Webserver hochgeladen werden.
Alle anderen Dateien k&ouml;nnen per FTP auch im ASCII-Modus hochgeladen werden.</p>
<br></li>
<li><p>Legen Sie ein zweites logisches Webserververzeichnis (vorzugsweise als Alias &quot;/webmail&quot;) als scheinbares
Hauptverzeichnis und als Datenhalde f&uuml;r <b><font color="#006600">WebMail</font></b> mitten im ganz normalen
Dokumentenverzeichnis Ihre Webs an.
&Uuml;ber diesen Alias erfolgt zuk&uuml;nftig der Einstieg in das <b><font color="#006600">WebMail</font></b>-System.
Das Verzeichnis wird im folgenden als <i>Webmail</i>verzeichnis betitelt.</p>
<p>In diesem Verzeichnis werden w&auml;hrend der Arbeit von <b><font color="#006600">WebMail</font></b> au&szlig;erdem
tempor&auml;r die etwaigen Attachments entsprechender e-Mails der Teilnehmer zwecks Download gespeichert.
Deshalb muss dieses Verzeichnis au&szlig;er ganz normalen <I>Leserechten</I> noch zus&auml;tzlich &uuml;ber <i>Schreibrechte</i> verf&uuml;gen.
<I>Script</I>- oder <I>Ausf&uuml;hren</I>-Rechte sollten abgeschaltet sein.
Ein <i>Durchsuchen</i> sollte ebenfalls nicht erlaubt werden.</p>
<p><u>Hinweis</u> (Windows): Unter MS-IIS und Win-NT/Win-2000 reicht es meist nicht aus, die Schreibrechte f&uuml;r &quot;/webmail&quot; &uuml;ber die Webserververwaltung zu setzen.
Meist m&uuml;ssen die Schreibrechte f&uuml;r dieses eine Verzeichnis auch auf Betriebssystem-Ebene f&uuml;r den Benutzer &quot;Jeder&quot; gew&auml;hrt werden.
Sie erkennen dieses Problem daran, da&szlig; die Benutzer keine Mail-Anh&auml;nge und keine Quelltexte herunterladen k&ouml;nnen.</p>
<p><u>Hinweis</u> (Linux): Unter Linux m&uuml;ssen Sie die Schreibrechte f&uuml;r dieses eine Verzeichnis so einstellen, da&szlig; <b><font color="#006600">WebMail</font></b> &uuml;ber den Webserverprozess hier vollen Zugriff hat.
Standardm&auml;&szlig;ig arbeitet Apache-Webserver als <i>wwwuser</i> und <i>nogroup</i>. Damit dieser Proze&szlig;besitzer tempor&auml;r in das Verzeichnis &quot;/webmail&quot; schreiben kann, ist f&uuml;r das ganze virtuelle Serververzeichnis &quot;/webmail&quot; eventuell &quot;drwxrwxrwx&quot; notwendig.
Sie erkennen dieses Problem daran, da&szlig; die Benutzer sonst keine Mail-Anh&auml;nge und keine Mail-Quelltexte herunterladen k&ouml;nnen.</p><br></li>
<li><p>In dieses logische Webmailverzeichnis legen Sie das Startframe &quot;index.htm(l)&quot; (das Sie so umbenennen,
wie bei Ihnen die Default-Seite auch immer hei&szlig;en muss) und die Grafikelemente f&uuml;r die <b><font color="#006600">WebMail</font></b>-Seiten.
Das Startframe &quot;index.htm(l)&quot; erhalten Sie je nach beabsichtigter Programmversion durch Umbenennen aus meinem Muster &quot;index_cgi.htm&quot; oder &quot;index_isapi.htm&quot;.
Falls Sie f&uuml;r das Programmverzeichnis von <b><font color="#006600">WebMail</font></b> (siehe <a href="#M2">1.</a>) ein
anderes Verzeichnis als &quot;/wmprog&quot; (Windows) bzw. &quot;/cgi-bin&quot; (Linux) gew&auml;hlt haben, m&uuml;ssen Sie den Pfad zum Teil-Frame anpassen.</p>
Es sind folgende Dateien in das Webmailverzeichnis zu &uuml;bertragen:
<table CELLSPACING=3 CELLPADDING=2 WIDTH="90%">
<tr BGCOLOR="#FFFF99"><td>Datei</td><td>Bedeutung</td></tr>
<tr BGCOLOR="#FFFFCC"><td>index.htm, dummy.htm</td><td>Startframe und Leer-Seite das Frame (obligatorisch)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>webmail.css</td><td>zentrale Style-Sheet-Vorlage f&uuml;r alle Ausgabeseiten (empfohlen)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>texture.gif</td><td>Hintergrundbild f&uuml;r die Ausgabeseiten des Webmail-Interface (fakultativ)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>mail_in.gif, mail_out.gif, mail_snd.gif, folder.gif, drafts.gif, trash.gif, book.gif, tools.gif</td><td>Cliparts f&uuml;r die Navigationsleiste (obligatorisch)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>fold_new.gif, fold_big.gif, book_mini.gif, letter_mini.gif, sign_pen.gif, sign_mini.gif, key.gif</td><td>Cliparts f&uuml;r die Ordnerverwaltung (obligatorisch)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>arrow_a.gif, arrow_b.gif</td><td>Symbole f&uuml;r die Sortierung der Nachrichten in den Mailboxen</td></tr>
<tr BGCOLOR="#FFFFCC"><td>letter.gif, wmlogo1.gif</td><td>allgemeines Clipart zur Verwendung in der Masterschablone (fakultativ)</td></tr>
<tr BGCOLOR="#FFFFCC"><td>loadmail.htm, loadmail.gif</td><td>Popup-Fenster mit Wartezeit-Animation beim Empfang langer Nachrichten (fakultativ)</td></tr>
</table>
<p>Einzelne Elemente d&uuml;rfen auch unter einem sonstigen Alias in Ihrem Web liegen.
Dann m&uuml;ssen Sie aber die HTML-Schablonenvorlagen dementsprechend anpassen.</p></li>
<LI><p>Legen Sie au&szlig;erhalb Ihres Webs (das soll hei&szlig;en: au&szlig;erhalb des Zugriffsbereichs der Webserver-Benutzer) ein drittes
Verzeichnis (vorzugsweise &quot;mailboxen&quot;) an. Dort hinterlegt <b><font color="#006600">WebMail</font></b> zuk&uuml;nftig
die Nachrichtenarchive der Benutzer. Dieses Verzeichnis soll im weiteren als Mailboxverzeichnis bezeichnet werden.</p></LI>
<LI>Kopieren Sie in dieses Mailboxverzeichnis die Benutzerdatenbank &quot;DataBase.txt&quot; sowie das leere zentrale Adressbuch &quot;Address.txt&quot;.
<p>Das gesamte Mailboxverzeichnis und die Datenbank &quot;DataBase.txt&quot; sowie das zentrale Adressbuch &quot;Address.txt&quot; werden
von <b><font color="#006600">WebMail</font></b> zuk&uuml;nftig gelesen und geschrieben.
Unter Windows ist daf&uuml;r meist nichts gesondert einzustellen.
Unter Linux versehen Sie das gesamte Mailboxverzeichnis und die &quot;DataBase.txt&quot; und die &quot;Address.txt&quot; mit Schreib- und Leserechten f&uuml;r den Webserverprozess.</p>
</LI>
<li><p>Zusammenfassung:</p>
Zusammenfassend hier noch einmal alle Einzelheiten im &Uuml;berblick:
<table CELLSPACING="3" CELLPADDING="2" WIDTH="90%">
<tr BGCOLOR="#FFFF99"><td>Verzeichnis</td><td>Beispielname</td><td>Dateien</td><td>Rechte f&uuml;r Web-Besucher</td><td>Rechte auf Betriebssystemebene</td>
</tr><tr BGCOLOR="#FFFFCC">
 <td valign="top">Programmverzeichnis</td>
 <td valign="top">/cgi-bin oder<br>/wmprog oder<br><nobr>/cgi-bin/wmprog</nobr></td>
 <td valign="top">webmail.exe, webmail.dll oder webmail.cgi<br>webmail.ini<br>diverse *.htm (Schablonen)</td>
 <td valign="top">Ausf&uuml;hren &uuml;ber den Webserver,<br>kein Auslesen &uuml;ber den Webserver</td>
 <td valign="top">Lesen, Ausf&uuml;hren<br><br><small><u>Ausnahme</u>: webmail.ini muss vom CGI-Prozess/ISAPI-Prozess gelesen und geschrieben werden.</small></td>
</tr><tr BGCOLOR="#FFFFCC">
 <td valign="top"><nobr>WebMail-Verzeichnis</nobr><br><small>(und tempor&auml;re Datenhalde)</small></td>
 <td valign="top">/webmail</td>
 <td valign="top">index.htm(l), webmail.css<br>eventuell dummy.htm<br>diverse *.gif (Grafiken) </td>
 <td valign="top">normales Lesen &uuml;ber den Webserver </td>
 <td valign="top">volle Schreib- und Leserechte f&uuml;r den CGI-Prozess/ISAPI-Prozess (Unterverzeichnis anlegen, Dateien schreiben, lesen, umbenennen, l&ouml;schen)</td>
</tr><tr BGCOLOR="#FFFFCC">
 <td valign="top">Mailboxverzeichnis</td>
 <td valign="top">mailboxen </td>
 <td valign="top">DataBase.txt<br>Address.txt</td>
 <td valign="top">keinerlei Zugriff f&uuml;r Web-Besucher &uuml;ber den Webserver</td>
 <td valign="top">volle Schreib- und Leserechte (Unterverzeichnis anlegen, Dateien schreiben, lesen, umbenennen, l&ouml;schen) f&uuml;r den CGI-Prozess/ISAPI-Prozess</td>
</tr>
</table>
</li>
</ol>
<p>Damit ist die Installation von <b><font color="#006600">WebMail</font></b>
bereits abgeschlossen.

<h2><a NAME="M3"></a>3. Starten und Einrichten des Webmail-Interfaces</h2>
Durch Aufruf von <a href="http://localhost/webmail">http://www.yourdomain.de/webmail</a>
bzw. <a href="http://localhost/webmail/index.htm">http://www.yourdomain.de/webmail/index.htm</a>(l)
&uuml;ber die Adresszeile Ihres Browsers oder einen gleichlautenden Hyperlink
in einer beliebigen Seite Ihres Webs starten Sie <b><font color="#006600">WebMail</font></b>.

<p>Beim allerersten Aufruf von <b><font color="#006600">WebMail</font></b> sehen Sie einmalig die Setup-Seite,
in der Sie als Webmaster einige Variablen setzen m&uuml;ssen.
Die Pfadangaben unterscheiden sich dabei systemspezifisch zwischen den Windows-Versionen und der Linux-Variante.
Hier als Beispiel die Windows-Version:</p>

<center><table BORDER CELLPADDING=4 WIDTH="99%" BACKGROUND="texture.gif"><tr><td>
[ <font size=-1><a href="/">Home</a></font>]
<h3><img SRC="letter.gif" ALT="letter" BORDER=0 height=17 width=32 align=RIGHT>WebMail-Setup</h3><hr>
<center>
<p>Vor der Benutzung von <FONT COLOR="#007000"><B>WebMail</B></FONT> m&uuml;ssen Sie als Administrator <I>eimalig</I> folgende Werte einstellen</p>
<TABLE>
 <TR><TD ALIGN="right">physischer Basispfad zu Mailboxarchiven und Datenbank:</TD><TD><INPUT TYPE="text" SIZE=40 NAME="BoxBaseDir"></TD><TD>z.B. C:\MailBoxen</TD></TR>
 <TR><TD ALIGN="center" COLSPAN="3"><SMALL>(Dieses Verzeichnis sollte aus Sicherheitsgr&uuml;nden au&szlig;erhalb des Webs liegen, sodass es &uuml;ber den Webserver nicht abrufbar ist.)<BR><BR></SMALL></TD></TR>
 <TR><TD ALIGN="right">virtueller Pfad zum Webmailverzeichnis:</TD><TD><INPUT TYPE="text" SIZE=40 NAME="HeapAlias"></TD><TD>z.B. /webmail</TD></TR>
 <TR><TD ALIGN="right">physischer Pfad zum Webmailverzeichnis:</TD><TD><INPUT TYPE="text" SIZE=40 NAME="HeapDir"></TD><TD>z.B. C:\wwwroot\webmail</TD></TR>
 <TR><TD ALIGN="center" COLSPAN="3"><SMALL>(Hier m&uuml;ssen das Startframe und die Grafikelemente f&uuml;r WebMail liegen. Au&szlig;erdem legt WebMail w&auml;hrend der Arbeit<br>in diese Verzeichnis tempor&auml;r eventuelle Mail-Attachments, damit diese von den Benutzern abgerufen werden k&ouml;nnen.)<BR><BR></SMALL></TD></TR>
 <TR><TD ALIGN="right">Administrator-Name (f&uuml;r Vollversion):</TD><TD><INPUT TYPE="text" SIZE=15 NAME="Owner"></TD><TD>&nbsp;</TD></TR>
 <TR><TD ALIGN="right">Administrator-Pa&szlig;wort (f&uuml;r Vollversion):</TD><TD><INPUT TYPE="password" SIZE=15 NAME="Pass"> Bitte selber w&auml;hlen!</TD><TD>&nbsp;</TD></TR>
 <TR><TD ALIGN="right">Registriercode (f&uuml;r Vollversion):</TD><TD><INPUT TYPE="text" SIZE=15 NAME="Code"></TD><TD>&nbsp;</TD></TR>
</TABLE></center>
</td></tr></table></center>
<p>Alle Ordner m&uuml;ssen bereits existieren (vgl. Punkt 2 - <A HREF="#M2">Installation</A>).</p>
Nach dem Eintragen der Werte werden Sie auf die Administrator-Seite des <FONT COLOR="#007000"><B>WebMail</B></FONT>-Interface geleitet.
<p>Falls Sie sp&auml;ter einmal die Einrichtungswert ver&auml;ndern wollen, rufen Sie einfach
<a href="http://localhost/wmprog/webmail.exe/master">http://www.yourdomain.de/wmprog/webmail.xxx/master</a> auf,
wobei <i>xxx</i> f&uuml;r die Endung der von Ihnen verwendeten Variante (Linux: <i>*.cgi</i>, Windows-CGI: <i>*.exe</i> oder bei ISAPI: <i>*.dll</i>) steht.</p>
<U><B>Achtung:</B></U> In der Demoversion von <FONT COLOR="#007000"><B>WebMail</B></FONT> kann jeder Client diese Master-Seiten aufrufen und die Einstellungen ver&auml;ndern.
In der Vollversion sind die Administrator-Seite gesch&uuml;tzt und nur dem Webmaster zug&auml;nglich!

<h2><a NAME="M4"></a>4. Demonstrationsm&ouml;glichkeit</h2>
Damit Sie die Arbeitsweise von <FONT COLOR="#007000"><B>WebMail</B></FONT> sofort testen k&ouml;nnen, ist ein
Demouser in der beiliegenden Datenbank bereits eingerichtet. Dieser hat den Benutzernamen <b><i>demouser</i></b>
und das Passwort <b><i>demo</i></b>. Ihm ist ein reales Postfach im
Internet mit der Adresse <b>demo.user@justmail.de</b> zugeordnet.
<p>Senden Sie also zun&auml;chst mit Ihrem bisherigen Mailprogramm herk&ouml;mmlich
eine Nachricht an <b>demo.user@justmail.de</b>. Nach der &uuml;blichen
&Uuml;bertragungszeit sollten Sie beim Einloggen in das <FONT COLOR="#007000"><B>WebMail</B></FONT>-Interface
mit den Daten <b><i>demouser</i></b> (als Benutzername) und <b><i>demo</i></b> (als Passwort) Zugriff
auf das Postfach erhalten und Ihre gesendete e-Mail sowie weitere Nachrichten
vorfinden. Voraussetzung f&uuml;r ein erfolgreiches Login ist eine bestehende
Verbindung zum Internet.
<p>Bitte belassen Sie meine Nachrichten mit dem Subject &quot;<i>Bitte nicht l&ouml;schen</i>&quot;
auf dem Server. Ihre eigene e-Mail sollten Sie nach dem Lesen freundlicherweise wieder l&ouml;schen.
<p><u><B>Achtung:</B></u> Sofern ich Missbrauch dieses Postfaches (strafrechtlich
relevant oder hochgradig unmoralisch) feststelle, werde ich das Postfach
sperren. Bitte verhalten Sie sich fair gegen&uuml;ber anderen Usern!

<h2><a NAME="M5"></a>5. Anpassung des Layouts</h2>
Im Gegensatz zur Funktion des <FONT COLOR="#007000"><B>WebMail</B></FONT>-Interfaces ist das Layout bequem
austauschbar. Sie brauchen lediglich einige Schablonenvorlagen Ihren Vorstellungen
entsprechend anzupassen. Das Fehlen der Schablonen f&uuml;hrt allerdings
zu Fehlermeldungen bei der Arbeit des Interfaces.

<h3><a NAME="M51"></a>5.1. zentrales Masterlayout</h3>
Das grundlegende Aussehen <b>aller</b> Ausgabeseiten von <b><font color="#006600">WebMail</font></b>
wird durch die Schablone <i>webmail.htm</i> bestimmt. Hierbei handelt es
sich um eine Webseite, innerhalb der alle &uuml;blichen Gestaltungsm&ouml;glichkeiten
inclusive von Navigationselementen und grafischen Objekten bis hin zu CSS realisiert werden k&ouml;nnen.
<p>Zus&auml;tzlich zu sonstigen HTML-Elementen <i>m&uuml;ssen</i>
einige systemspezifische Platzhalter-Tags eingebaut sein. An diesen Stellen
f&uuml;gt <b><font color="#006600">WebMail</font></b> seine mail-spezifischen
Ausgaben dynamisch ein.</p>
<p>Die Platzhalter-Tags f&uuml;r die Masterschablone <i>webmail.htm</i>
lauten:
<br>&nbsp;
<center><table CELLSPACING=3 CELLPADDING=2 WIDTH="90%">
<tr BGCOLOR="#FFFF99"><td>Tag</td><td>Beschreibung</td><td>Status</td><td>Verwendung</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC"><td>&lt;#TITLE></td><td>von WebMail erzeugter Titelstring</td><td>obligatorisch</td><td>mehrmals</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC">
<td>&lt;#CONTENT></td><td>mailspezifisches Ergebnis und Hauptinhalt der jeweiligen Anfrage an das Webmail-Interface</td><td>obligatorisch</td><td>einmalig</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC"><td>&lt;#SCRIPTDIR></td>
<td>von WebMail selbst erkannter logischer Programmpfad zu WebMail,
beginnend im Wurzelverzeichnis des Webs (also beispielsweise &quot;/cgi-bin/wmprog&quot;)</td>
<td>fakultativ</td><td>mehrmals</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC"><td>&lt;#HEAPALIAS></td>
<td>logischer Pfad (Alias) des Webmailverzeichnisses, in dem die Grafiken und das Frameset zu <FONT COLOR="#007000"><B>WebMail</B></FONT>
abgelegt sind (also beispielsweise &quot;/webmail/&quot;) beginnend und endend mit &quot;/&quot;</td>
<td>fakultativ</td><td>mehrmals</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC"><td>&lt;#DATE></td><td>Ausgabedatum der Seite</td><td>fakultativ</td><td>mehrmals</td></tr>
<tr VALIGN=TOP BGCOLOR="#FFFFCC"><td>&lt;#TIME></td><td>Ausgabezeit der Seite</td><td>fakultativ</td><td>mehrmals</td></tr>
</table></center>

<p>Alle Platzhalter-Tags <i>m&uuml;ssen</i> mit dem Zeichen <i>#</i> beginnen
und in <i>Grossbuchstaben</i> ausgef&uuml;hrt sein. Anderenfalls ist die
Funktion des Webmail-Interfaces nicht gew&auml;hrleistet.
<p>Die beiliegende Schablone <i>webmail.htm</i> bietet in etwa den folgenden
Inhalt und kann als Muster angesehen werden:
<br>&nbsp;
<center><table BORDER CELLPADDING=6 WIDTH="98%" BACKGROUND="texture.gif">
<tr><td>
[ <font size=-1><a href="/" target="_top">Home</a></font>]
<h3><img SRC="letter.gif" ALT="letter" BORDER=0 height=17 width=32 align=RIGHT>&lt;#TITLE></h3>
<hr>
<p>&lt;#CONTENT>
<p>
<hr>[ <font size=-1><a href="/" target="_top">Home</a></font> ] [ <font size=-1><a href="#top">nach oben</a></font> ]
<p align="center"><img SRC="letter.gif" ALT="letter"> <font size=-1>&lt;#DATE>,&lt;#TIME></font></p>
</td></tr>
</table></center>
<p>Der Quelltext dieser Seite w&uuml;rde dann lauten:</p>
<DIV align="center">
<TABLE BGCOLOR="#FFFFCC" width="90%"><TR><TD><PRE>
 &lt;HTML&gt;
 &lt;HEAD&gt;
  &lt;meta http-equiv=&quot;expires&quot; content=&quot;0&quot;&gt;
  &lt;meta http-equiv=&quot;pragma&quot; content=&quot;no-cache&quot;&gt;
  &lt;meta http-equiv=&quot;cache-control&quot; content=&quot;no-cache&quot;&gt;
  &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;&lt;#HEAPALIAS&gt;webmail.css&quot;&gt;
  &lt;title&gt;&lt;#TITLE&gt;&lt;/title&gt;
 &lt;/HEAD&gt;
 &lt;BODY&gt;
 [ &lt;SMALL&gt;&lt;A HREF=&quot;/&quot; target=&quot;_top&quot;&gt;Home&lt;/A&gt;&lt;/SMALL&gt; &lt;A NAME=&quot;top&quot;&gt;]&lt;/A&gt;
 &lt;H2&gt;&lt;IMG SRC=&quot;&lt;#HEAPALIAS&gt;letter.gif&quot; ALIGN=&quot;right&quot; ALT=&quot;letter&quot; BORDER=&quot;0&quot;&gt;&lt;#TITLE&gt;&lt;/H2&gt;
 &lt;HR&gt;
 &lt;#CONTENT&gt;
 &lt;HR&gt;
 [ &lt;SMALL&gt;&lt;A HREF=&quot;/&quot; target=&quot;_top&quot;&gt;Home&lt;/A&gt;&lt;/SMALL&gt; ] [ &lt;SMALL&gt;&lt;A HREF=&quot;#top&quot;&gt;nach oben&lt;/A&gt;&lt;/SMALL&gt; ]
 &lt;P ALIGN=&quot;CENTER&quot;&gt;
  &lt;IMG SRC=&quot;&lt;#HEAPALIAS&gt;letter.gif&quot; ALT=&quot;letter&quot; BORDER=&quot;0&quot;&gt; &lt;SMALL&gt;&lt;#DATE&gt;, &lt;#TIME&gt;&lt;/SMALL&gt;
 &lt;/P&gt;
 &lt;/BODY&gt;
 &lt;/HTML&gt;</PRE></TD></TR></TABLE>
</DIV>
<p>Anstatt von &lt;#HEAPALIAS&gt; d&uuml;rfen Sie an dieser Stelle selbstverst&auml;ndlich auch die tats&auml;chlichen Pfade
zu den Grafikelementen im Webmailverzeichnis eintragen.
Alle Pfadangaben m&uuml;ssen falls sie relativ sind relativ zum Programmverzeichnis von <b><font color="#006600">WebMail</font></b> erfolgen
und nicht etwa in Bezug zum Webmailverzeichnis, in dem die Frameseite <i>index.htm</i> und die Grafiken liegen.
</p>
Die Masterschablonenseite <i>webmail.htm</i> greift momentan beispielsweise auf die CSS-Vorlage <i>webmail.css</i> zur&uuml;ck,
deren Gebrauch aber nicht zwingend notwendig ist.
Wenn Sie das Layout bequem komplett ver&auml;ndern wollen, tauschen Sie bei Gefallen einfach die aktuelle
Datei <i>webmail.css</i> gegen die beiliegende Datei <i>webmail-dunkel.css</i> aus.
Oder Sie ver&auml;ndern die style-formatierten Elemente in der Datei <i>webmail.css</i>.
Einen &Uuml;berblick &uuml;ber die wichtigsten CSS-formatierten Seitenelemente in <b><font color="#006600">WebMail</font></b> erhalten Sie in der folgenden Grafik:
<p align="center"><img src="WebMailCSS.gif" alt="Styles" border="0"></p>
Um beispielsweise die Navigationsleiste links anders einzuf&auml;rben, m&uuml;ssen Sie in der CSS-Datei <i>webmail.css</i> das
Element <i>td.navbar</i> ab&auml;ndern, welches momentan folgenderma&szlig;en formatiert ist:
<center><table cellpadding="8" WIDTH="96%">
<tr BGCOLOR="#FFFFCC"><td>td.navbar { background-color:#E7E7E7; font-size:11px; text-align:center; vertical-align:top; }</td></tr>
</table></center>
<p><u><B>Hinweis:</B></u> Aufgrund des Caching-Mechanismus einiger Webserver werden
&Auml;nderungen am Masterlayout eventuell erst nach Entladen des <b><font color="#006600">WebMail</font></b>-Interface
durch Herunterfahren und Neustart des Webservers wirksam.
Gelegentlich muss auch der Browser-Cache geleert werden, ehe die Ver&auml;nderungen sichtbar sind.</p>

<h3><a NAME="M52"></a>5.2. Detailschablonen</h3>
Die Detaillayouts werden durch das <b><font color="#006600">WebMail</font></b>-Interface an der Stelle des
Platzhalters &lt;#CONTENT> in das Masterlayout eingef&uuml;gt.
Jede Ausgabeseite von <b><font color="#006600">WebMail</font></b> benutzt ein anderes Detaillayout.
Jedes Detaillayout verf&uuml;gt seinerseits &uuml;ber spezielle Platzhalter-Tags.
<p>Bei den Detaillayouts handelt es sich <i>nicht</i> um komplette HTML-Seiten,
sondern lediglich um HTML-formatierte Sequenzen bzw. Fragmente.
Das Layout der Detailvorlagen kann wiederum frei ver&auml;ndert werden.
Die Platzhaltertags, die Namen etwaiger Formularfelder und die Spaltenzahl angedeuteter Tabellen m&uuml;ssen erhalten bleiben.
<p>Da die Detaillayouts im Gegensatz zum Masterlayout erfahrungsgem&auml;&szlig; nur von wenigen Webmastern ver&auml;ndert werden,
finden Sie deren umfangreiche Beschreibung in einer separaten Datei <a href="LiesMich2.htm">LiesMich2.htm</a>.</p>
Hier lediglich der Gliederungs&uuml;berblick f&uuml;r die Anpassung der Detailschablonen:<p><b>
&nbsp;<a href="LiesMich2.htm#521">5.2.1.</a> Login-Formular (login.htm)<br>
&nbsp;<a href="LiesMich2.htm#522">5.2.2.</a> Ordner&uuml;bersicht und Ordnerverwaltungs-Formular (folders.htm)<br>
&nbsp;<a href="LiesMich2.htm#523">5.2.3.</a> MailBox-Seite mit Posteingang auf dem POP3-Server (mailbox.htm)<br>
&nbsp;<a href="LiesMich2.htm#524">5.2.4.</a> MailBox-Seite f&uuml;r privaten Posteingangs- oder Postausgangs-Archivordner (privbox.htm)<br>
&nbsp;<a href="LiesMich2.htm#525">5.2.5.</a> Nachrichtendetailanzeige (showmail.htm)<br>
&nbsp;<a href="LiesMich2.htm#526">5.2.6.</a> Formular zum Verfassen einer Nachricht (writemail.htm)<br>
&nbsp;<a href="LiesMich2.htm#527">5.2.7.</a> Sendebest&auml;tigung (sendok.htm)<br>
&nbsp;<a href="LiesMich2.htm#528">5.2.8.</a> Signatur und Textbausteine (textpieces.htm)<br>
&nbsp;<a href="LiesMich2.htm#529">5.2.9.</a> Adressbuch-Listen (adrlist.htm, abook.htm und adrcent.htm)<br>
&nbsp;<a href="LiesMich2.htm#5210">5.2.10.</a> Adressbuch-Detailanzeige (adrshow.htm)<br>
&nbsp;<a href="LiesMich2.htm#5211">5.2.11.</a> &ouml;ffentliche Benutzerdateneingabe (admin.htm)<br>
&nbsp;<a href="LiesMich2.htm#5212">5.2.12.</a> Benutzerdatenbest&auml;tigung (adminok.htm)<br>
&nbsp;<a href="LiesMich2.htm#5213">5.2.13.</a> Benutzerverwaltung f&uuml;r den Webmaster (users1.htm, users2.htm)</b></p>

<h2><a NAME="M6"></a>6. Benutzereinrichtung und -verwaltung</h2>
WebMail verf&uuml;gt &uuml;ber eine integrierte webbasierte Benutzereinrichtung und -verwaltung.
Alle Benutzerdaten werden in einer Benutzerdatenbank (Textdatei <i>DataBase.txt</i>) gespeichert.
Diese Datei <i>DataBase.txt</i> liegt in der vorliegenden Version von <b><font color="#006600">WebMail</font></b>
im Mailboxverzeichnis (vorzugsweise &quot;<i>mailboxen</i>&quot;, vergleiche Punkt 2 - <A HREF="#M2">Installation</A>).
Obwohl die Passw&ouml;rter nicht im Klartext gespeichert werden ist es wichtig,
dass diese Datentabelle im Mailboxverzeichnis m&ouml;glichst au&szlig;erhalb des Dokumentenbereiches des Webs liegt und
keine Lesem&ouml;glichkeiten f&uuml;r Besucher &uuml;ber den Webserver vorhanden sind.
<p>Es gibt zwei Zugangswege zur Benutzerdatenverwaltung.
Einen Vollzugriff ausschlie&szlig;lich f&uuml;r den Webmaster und einen mit mehr oder weniger Einschr&auml;nkungen versehenen
Zugriff f&uuml;r die Benutzer des <b><font color="#006600">WebMail</font></b>-Interfaces.</p>

<h3><A NAME="M61"></A>6.1. Die &ouml;ffentliche Benutzerdatenverwaltung durch die Benutzer</h3>
Diese Benutzereinrichtung ist &uuml;ber den Aufruf von <b><font color="#006600">WebMail</font></b>
mittels <a href="http://localhost/wmprog/webmail.exe/admin">http://www.mydomain.de/wmprog/webmail.xxx/admin</a>
(wobei <i>xxx</i> die zu Ihrer Variante passende Programmendung ist) erreichbar.
Dieser URL ist f&uuml;r alle Benutzer von <b><font color="#006600">WebMail</font></b> freigegeben
und entspricht dem Hyperlink &quot;[Benutzerdatenverwaltung]&quot; auf dem Login-Formular.
Jeder Benutzer kann also seine Daten selbst eintragen.
Sie sollten Benutzern, die Ihren Mailaccount unter <b><font color="#006600">WebMail</font></b> selbst einrichten d&uuml;rfen,
diesen speziellen Aufruf von <b><font color="#006600">WebMail</font></b> bekannt machen
(indem Sie z.B einen Link auf diese Adresse setzen oder den vorhandnen Link in der Schablone <I>login.htm</I> belassen).
<p><b>Hinweise:</b> W&auml;hrend des Setups von <b><font color="#006600">WebMail</font></b> (siehe <a href="#M3">3.</a>) k&ouml;nnen Sie als WebMaster entscheiden,
ob &uuml;ber diese &ouml;ffentliche Verwaltung nur bereits vorhandene Benutzer ihre Daten bearbeiten k&ouml;nnen
oder ob auch die Einrichtung neuer Konten durch die Benutzer selbst erlaubt ist.</p>
<p>Nach Aufruf sehen Sie bzw. der Benutzer ein Login-Formular zum Eintragen von Usernamen und Passwort des Benutzers.
Ist der eingetragene Benutzer in der Datenbank bekannt, erscheinen seine gespeicherten Daten zur Aktualisierung.
Anderenfalls erscheint f&uuml;r neue, bisher nicht bekannte Benutzer ein leeres Formular.
Folgende Angaben sind f&uuml;r die Arbeit mit <b><font color="#006600">WebMail</font></b> notwendig.</p>
<center><table BORDER CELLPADDING=6 WIDTH="96%" BACKGROUND="texture.gif"><tr><td ALIGN=CENTER>
<form><br>
<table BGCOLOR="#F3F3EF" >
<tr><td ALIGN=RIGHT>Username:</td><td><input TYPE="text" SIZE=15 NAME="User"></td><td>Username f&uuml;r Login bei WebMail</td></tr>
<tr><td ALIGN=RIGHT>Passwort:</td><td><input TYPE="password" SIZE=15 NAME="PassU"></td><td>Passwort f&uuml;r Login bei WebMail</td></tr>
<tr><td ALIGN=RIGHT>Name:</td><td><input TYPE="text" SIZE=40 NAME="Sender"></td><td>Ihr realer Absendername</td></tr>
<tr><td ALIGN=RIGHT>e-Mail:</td><td><input TYPE="text" SIZE=30 NAME="eMail"></td><td>Ihre e-Mail-Adresse</td></tr>
<tr><td ALIGN=RIGHT>POP3-Server:</td><td><input TYPE="text" SIZE=30 NAME="Pop3"></td><td>Domain-Name des POP3-Servers (z.B. pop3.net.de)</td></tr>
<tr><td ALIGN=RIGHT>SMTP-Server:</td><td><input TYPE="text" SIZE=30 NAME="Smtp"></td><td>Domain-Name des Postausgangsservers (z.B. mail.net.de)</td></tr>
<tr><td ALIGN=RIGHT>Kontoname:</td><td><input TYPE="text" SIZE=15 NAME="Konto"></td><td>Ihr Account f&uuml;r das POP3-Postfach</td></tr>
<tr><td ALIGN=RIGHT>Passwort:</td><td><input TYPE="password" SIZE=15 NAME="Pass"></td><td>Passwort f&uuml;r das POP3-Postfach</td></tr>
<tr><td align="right">POP3&nbsp;vor&nbsp;SMTP:</td><td><input type="checkbox" name="PbefS"></td><td>nur wenn zum Senden notwendig</td></tr>
<tr><td align="right">Benutzername:</td><td><input type="text" size=30 name="AuthK"></td><td>nur bei authentifiziertem Senden<br>&nbsp; <small>(meist identisch mit POP3-Kontoname, sonst leer lassen)</small></td></tr>
<tr><td align="right"> Passwort:</td><td><input type="password" size=15 name="AuthP"></td><td>nur bei authentifiziertem Senden<br>&nbsp; <small>(meist identisch mit POP3-Passwort, sonst leer lassen)</small></td></tr>
</table>
</form>
</td></tr></table></center>
<p>Diese Benutzerdateneinrichtung wird aus der HTML-Detailschablonen namens <i>admin.htm</i> generiert.
Hier&uuml;ber haben Sie als Administrator die M&ouml;glichkeit, die Selbstverwaltung der Benutzer eventuell weiter einzuschr&auml;nken oder zu unterbinden.</p>
<p>Wenn Sie die Detailschablone <i>admin.htm</i> aus dem Programmverzeichnis von <b><font color="#006600">WebMail</font></b>
entfernen, k&ouml;nnen die Benutzer in keiner Weise ihre Daten selbst ver&auml;ndern.
Das Programm <b><font color="#006600">WebMail</font></b> arbeitet auch ohne diese Schablone korrekt weiter.</p>
<p>Wenn Sie die Selbstverwaltung der Benutzerdaten in Einzelheiten einschr&auml;nken wollen, m&uuml;ssen Sie die Schablone <i>admin.htm</i>
entsprechend modifizieren (siehe <a href="LiesMich2.htm#5211">5.2.11.</a> in der Datei <a href="LiesMich2.htm">LiesMich2.htm</a>).</p>
<p>Eine h&auml;ufig gew&uuml;nschte Einschr&auml;nkung umfasst beispielsweise die feste Vorgabe der beiden Mailserver (damit nicht
x-beliebige fremde Benutzer von Ihrem Webserver aus x-beliebige fremde Postf&auml;cher bedienen k&ouml;nnen
sondern nur mit dem Mailserver in Ihrem Web arbeiten d&uuml;rfen).
Tragen Sie in solchem Fall die Adresse des Mailservers fest in die Formularschablone <i>admin.htm</i> ein. Statt des Originalcodes:</p>
<center><table CELLSPACING=3 CELLPADDING=2 WIDTH="96%">
<tr VALIGN=TOP BGCOLOR="#FFFFCC">
<td>&nbsp;&lt;input type=&quot;text&quot; name=&quot;Pop3&quot; value=&quot;&lt;#POP3&gt;&quot;&gt;<br>&nbsp;&lt;input type=&quot;text&quot; name=&quot;Smtp&quot; value=&quot;&lt;#SMTP&gt;&quot;></td>
</tr>
</table></center>
<p>verwenden Sie die Ersatzkonstruktion:</p>
<center><table CELLSPACING=3 CELLPADDING=2 WIDTH="96%">
<tr VALIGN=TOP BGCOLOR="#FFFFCC">
<td>&nbsp;&lt;input type=&quot;hidden&quot; name=&quot;Pop3&quot; value=&quot;pop3.mydomain.net&quot;&gt;pop3.mydomain.net<br>&nbsp;&lt;input type=&quot;hidden&quot; name=&quot;Smtp&quot; value=&quot;smtp.mydomain.net&quot;&gt;smtp.mydomain.net</td>
</tr>
</table></center>
<p>Der Benutzer sieht zwar die Angaben zu seinem Mailserver, kann Sie aber nicht ver&auml;ndern sondern lediglich seine sonstigen
Angaben wie das Passwort f&uuml;r den Mailaccount selbst einstellen.</p>

<h3><A NAME="M62"></A>6.2. Die gesch&uuml;tzte Benutzerverwaltung durch den Administrator</h3>
Die Benutzerverwaltung von <b><font color="#006600">WebMail</font></b> wird
&uuml;ber <a href="http://localhost/wmprog/webmail.exe/master">http://www.mydomain.de/wmprog/webmail.xxx/master</a> oder direkt
&uuml;ber <a href="http://localhost/wmprog/webmail.xxx/users">http://www.mydomain.de/wmprog/webmail.xxx/users</a>
(wobei <i>xxx</i> wieder die zu Ihrer Variante passende Programmendung ist) aufgerufen. Dieser Zugang ist (in der Vollversion) nur f&uuml;r den Webmaster m&ouml;glich.
<p>Es erscheint eine tabellarische Auflistung aller in der Datenbank eingetragenen Benutzer,
allerdings ohne Klartextanzeige deren geheimer Kennw&ouml;rter.
Einzelne Benutzerdatens&auml;tze k&ouml;nnen komplett bearbeitet oder gel&ouml;scht werden.
Bei vergessenem <b><font color="#006600">WebMail</font></b>-Passwort kann f&uuml;r entsprechende Benutzer ein
neues <b><font color="#006600">WebMail</font></b>-Login-Passwort generiert oder eingetragen werden.
Dieses muss dann vom Webmaster manuell an den Nutzer &uuml;bermittelt werden.
Nach Login mit diesem neuen Passwort kann der User dann selbst&auml;ndig wieder ein individuelles Passwort
einrichten, sofern die Benutzerselbstverwaltung (siehe <a href="#M61">6.1.</a>) erlaubt ist.</p>
<p>F&uuml;r jeden Benutzer kann in der Userverwaltung die Maximalgr&ouml;&szlig;e des Speicherplatzes f&uuml;r dessen Mailboxarchiv
unter <b><font color="#006600">WebMail</font></b> auf dem Webserver festgelegt werden.
Erreicht ein Benutzer das festgelegte Limit, erh&auml;lt er bei den nachfolgenden Logins eine Warnung und den Hinweis,
Speicher frei zu machen.
Ignoriert er dieses, wird bei &Uuml;berschreitung seines Limits um 15% der Abruf neuer Nachrichten vom POP3-Server unterbunden.</p>
<p>Registrierte Webmaster der Vollversion von <b><font color="#006600">WebMail</font></b> erhalten ein Zusatztool,
mit dem Sie die Benutzerdatenbank <i>DataBase.txt</i> offline editieren k&ouml;nnen.
Dieses Programm <i>WMUsers.exe</i> liegt allerdings nur als Windows-Anwendung vor. Eine Linux-Variante ist nicht geplant.
Allerdings ist es m&ouml;glich, mit diesem Windows-Tool die auf Linux-Servern liegende Datenbank <i>DataBase.txt</i> zu
bearbeiten, sofern Zugriffsm&ouml;glichkeiten auf diese Datei gegeben sind.</p>

<h2><a NAME="M7"></a>7. Sicherheitshinweise</h2>
<b><p><font color="#006600">WebMail</font></b> hinterlegt normalerweise keinerlei Daten auf den Clientrechnern.
Einige Browser cachen aber unerlaubter Weise die Seiten von <b><font color="#006600">WebMail</font></b>, soda&szlig; ein r&uuml;ckw&auml;rts Bl&auml;ttern im Browser m&ouml;glich ist.
Das stellt bei der Benutzung von <b><font color="#006600">WebMail</font></b> von &ouml;ffentlichen Internet-Terminals aus ein gewisses Risiko dar.
Mit dem Logout am Ende der Sizung und dem Schlie&szlig;en des Browsers werden die Seiten aber sicher aufgel&ouml;st.</p>
Als Webmaster k&ouml;nnen Sie die Sicherheit f&uuml;r Ihre Benutzer forgenderma&szlig;en erh&ouml;hen:
<ol start="1" type="1">
<li><p>Betten Sie <b><font color="#006600">WebMail</font></b> in ein Frame-Set (<a href="#M3">siehe 3</a>) ein.
Dadurch erscheint nie der reale URL oder die Aufrufparameter von <b><font color="#006600">WebMail</font></b> in der Adresszeile des Browsers.</p></li>
<li><p>Sorgen Sie daf&uuml;r, da&szlig; im HEAD-Bereich der Masterschablone <i>webmail.htm</i> stets die folgenden drei Metatags stehen:<br>
<table CELLSPACING=3 CELLPADDING=2 WIDTH="92%">
<tr BGCOLOR="#FFFFCC"><td>&nbsp;&lt;META HTTP-EQUIV=&quot;cache-control&quot; content=&quot;no-cache&quot;&gt;<br>
&nbsp;&lt;META HTTP-EQUIV=&quot;expires&quot; CONTENT=&quot;0&quot;&gt;<br>
&nbsp&lt;META HTTP-EQUIV=&quot;pragma&quot; CONTENT=&quot;no-cache&quot;&gt;</td></tr>
</table></p></li>
<li><p>Weisen Sie Ihre Benutzer an anderen geeigneten Stellen darauf hin, unbedingt den Logout-Schalter zu benutzen und das Browserfenster beim Verlassen des Computers nach Gebrauch von <b><font color="#006600">WebMail</font></b> zu schlie&szlig;en.</p></li>
</ol>

<h2><a NAME="M8"></a>8. bekannte Probleme</h2>
<p>In Problemsituationen besteht die M&ouml;glichkeit, dass <b><font color="#006600">WebMail</font></b> Logfiles aufzeichnet.
Schalten Sie bei Bedarf &uuml;ber das Setup unter <a href="http://localhost/wmprog/webmail.exe/master">http://www.mydomain.de/wmprog/webmail.xxx/master</a> die LogFile-Aufzeichnung ein.
Die Logfiles rotieren t&auml;glich und werden in den Mailboxen-Ordner geschrieben, in dem die Datenbank <i>DataBase.txt</i> liegt.</p>

<h2><a NAME="M9"></a>9. Vollversion und rechtliche Hinweise</h2>
Das Programm wird seiner Funktion mit den beschriebenen Leistungsmerkmalen in einer &uuml;blichen Umgebung unter dem
Betriebssystem Windows bzw. Linux gerecht.
Dar&uuml;berhinausgehende Anspr&uuml;che werden nicht erf&uuml;llt.
Haftungssch&auml;den f&uuml;r unsachgem&auml;&szlig;en Gebrauch werden nicht &uuml;bernommen.
Ausdr&uuml;cklich wird darauf hingeweisen, dass der Betreiber des Webservers die alleinige Verantwortung f&uuml;r die Sicherung der
in den Mailboxarchiven liegenden Nachrichten tr&auml;gt. <b><font color="#006600">WebMail</font></b> legt in keiner Weise
Sicherheitskopien dieser Nachrichten an.
<p>Das System <b><font color="#006600">WebMail</font></b> ist nach bestem Wissen und Gewissen frei von Viren, W&uuml;rmern und Trojanern.
<p>Das Webmail-Interface darf in der vorliegenden Form frei genutzt werden.
Eine registrierte Vollversion des Produktes erhalten Sie &uuml;ber die Webseite des Autors.
Die Rechte f&uuml;r das Konzept und die Quelltexte bleiben beim Autor.
Nehmen Sie dazu unbedingt die <a href="http://www.hummel1.de/soft">Lizenzbestimmungen</a> zur Kenntnis.
<hr>
<p><b><font color="#009900">Allzeit nur gute Nachrichten in der Mailbox!!</font></b>
<p>J&uuml;rgen Hummel
<br>Internet: <a href="http://www.hummel1.de/">www.hummel1.de</a>
<br>e-Mail: <a href="mailto:post@hummel1.de?subject=WebMail">post@hummel1.de</a>
</body>
</html>